In [1]:
import numpy as np
import pandas as pd

In [2]:
import os 
# this is a function to return the last 4 digits of a credit card number
def last_four(num):
    return str(num)[-4:]



os.chdir(r'C:\Users\jogym\Documents\Jogy\Study\python\data\Pandas_excel')
cwd=os.getcwd()

csv_path=cwd + os.path.sep + 'movie_scores.csv'
df=pd.read_csv(csv_path)
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

Missing data
    - Keep it
    - Remove it
    - Replace it

    Drop a row or a column when lot of information is missing

In [ ]:
# NaN with NA

# np.NaN is replaced with np.NA
# np.nan == np.nan is false
# np.nan is np.nan is true

#checking nulls

# df.isnull() # returns true for all nulls

df.notnull() # returns false for all nulls

In [ ]:
#isnull
#notnull

df[df['pre_movie_score'].notnull()]

df[df['pre_movie_score'].isnull() & df['first_name'].notnull()]

In [ ]:
# Drop data
# Dropna

# df1=df.dropna(inplace=False) # drops columns having missing values

# #thresh
# df1.dropna(thresh=2) #this will drop rows that are not having atlease values in two fields


# #axis=1
# df1.dropna(axis=1)

#subset
df2=df.dropna(subset=['last_name']) # drops the row having lastname na
df2

In [23]:
# #fillna
df_fillna=df.fillna('new_value')
df_fillna
# # filling only selected column na value with a new value
df[['pre_movie_score','post_movie_score']]=df[['pre_movie_score','post_movie_score']].fillna(value=0)
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              0.0               0.0
2       Hugh   Jackman  51.0    m              0.0               0.0
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0